{
  "9240": {
    "title": "Zulu Nation Throwdown",
    "artist": "Afrika Bambaataa",
    "id": 1221,
    "year": 1980,
    "lyrics": "\n\nSay what's the name of this Nation?\nZulus\nZulus\nAnd who's gonna get on down?\nThe Cosmic Force\nThe Cosmic Force\n\nChitty-chitty-bang-bang, we are your main thing\nYou listen to the song that she is gonna sing-sing\nWe party all night to the people's delight\nCause everybody knows that we rock out of sight\nSay we are the best in the creation\nWe go by the name of the Mighty Zulu Nation\nWe're the Mighty Zulus, we're one of a crew\nWe're comin by, we're comin through\nWe're worldwide and we're citywide\nCause we shock the house, we shock it right\nWe'll say a little somethin to let you know\nThat my mellow Smitty D is on the echo\nWe do a routine and put on a show\nAnd we dedicate it to the people we know\nWe're one of a kind, we're easin the mind\nThe Zulu Nation say time after time\n\nTo the party people out there, we want y'all just to know\nThat we are the four MC's and we are the star of the show\nAha, at every Zulu Throwdown, say this is what you see\nAnd hear the voice (I'm Chubby Chub) (Ice-Ice) (Little Ikey C) (Lisa Lee)\nWe rock in the sunlight or any kind of weather\nCause we are the Force (everybody) that has our act together\nWe wanna party (party) dance (dance) and boogie all damn night\nDo-do-do-do, do, do, do-do-do-do\nWe got to amaze all you people that we're one hell of a sight\nDo-do-do-do, do, do, do-do-do-do\nSay standin up here are the four MC's that's devine\nDo-do-do-do, do, do, do-do-do-do\nWhile the people at the door are just standin in one big line\nDo-do-do-do, do, do, do-do-do-do\nNow some of our voices are high, some are low\nDo-do-do-do, do, do, do-do-do-do\nBut it don't make no difference, we can still all yell \"ho!\"\nDo-do-do-do, do, do, do-do-do-do\nWell, the song is almost over, and emceein is an art\nDo-do-do-do, do, do, do-do-do-do\nBecause when the party's jumpin, that's when the four will start\nDo-do-do-do, do, do, do-do-do-do\n\nRoll call, I want to get down\nSay roll call, we want to get down\nSay roll call, we want to get down\nWe are the four MC's, don't need no help\nSo (check out the way)\nSo (check out the way)\nSo check out the way we introduce ourselves\n\nShe's...\nLisa Lee, and from the top of the key\nYou know I'm guaranteed to be the queen of MC's\nHe's...\nMC Chubby Chub from the heavens above\nNo, I ain't never met a girl that I couldn'd shook up\nAnd he's...\nMC Ice-Ice, the shocker-rocker on the mic\nAnd doin it on, doin it high power, doin it right\nAnd he's...\nLittle Ikey C, and I'm the melody\nNow all you young ladies get sexy\nDo it\n\nThis is a story from the yesteryear\nSaid before it was the wack, but now the ladies cheer\nUntil we climb the ladder say one by one\nAnd while we did it, we spreaded some fun\nSay we change the tempo so you can clap your hands\nAnd then we add a little (?) so y'all can dance\nAnd you like our style, which is just our voice\nSo young ladies, come and pick your choice\nChubby Chub\nIce-Ice\nI'm Little Ikey C\nWe are the three MC's\nLisa Lee\nYou're the queen\nGo girl\nJust get on the mic and do your own thing\n\n[ Lisa Lee ]\nSo put your hands in the air and listen to me\nCause you listen to the voice of MC Lisa Lee\nDon't play no games, don't bite no style\nWhen you came through the door we gave you a smile\nWe want you to get loose, get ready to rock\nWe're gonna paralyze your mind and put you in shock\nWe're gonna make you wanna yell, scream and shout\nWe're gonna let you know without a doubt\nExactly what we be about\nRockin to the sounds that make you dance\nMake the ants crawl in your pants\nPut you in a music trance\nListen to the beat and let yourself go\nCause everybody knows this is nothin but a disco\nRock, shock the sure shot\nThis ain't a Broadway play or a high school plot\nIt's the real deal that makes you feel\nLike, like you got sex appeal\nNow party people in the place you feel the bass\nCan you check out the highs, check out the grace\nSo wallflowers in the house, this is your chance\nTo show everybody that you can dance\nPunk rock to the left, and Patty Duke to the right\nMove your body now, you can do it all night\nThese are the devastating words that you never heard before\nI'm Lisa Lee, hah, I got rhymes galore\nSo young ladies out there, he's from the heavens above\n\n[ Chubby Chub ]\nThat's right, never met a girl that I couldn't shook up\nSo won't you clap your hands and have some fun\nIt's the super dynamite (huh) MC Chubby Chub\nYou don't stop (hah) you don't stop (haha)\nGet it all together, girl, because we're startin to rock\nAnd to all the young ladies, yes his name is Chub\nSay I didn't come here to ask for your love\nCause I'm a cool, cool kid with a healthy mind\nAnd I figure that (?) will always take time\nI'm lookin for a girl that I can call mine\nWhen she walk down the street, the sun will shine\nAnd to all the young ladies, I'm talkin 'bout me\nCause I'm lookin for a girl that's so unique\nI'm not lookin for a girl that drives a car\nTo me she'll always be my superstar\nCause I'm lookin for a girl with a beautiful smile\nAnd a young lady that's worth my while\nYoung ladies out there, don't you get uptight\n\n[ Ice-Ice ]\nCause it's me, baby doll, MC Ice-Ice\nJust like a bike got wheels, sweet lemon peel\nNow the MC's, they know the deal\nThat we always rock and we can't be stopped\nWherever we rock and hit the latest spot\nI said the other MC's are standin tall\nBut the taller they are, the harder they fall\nCause we the, the Funkadelic on the microphone\nBecause we are the MC's that's all alone\nAnd when we get on the mic it's back to back\nI said that we're the crew that leads the pack\nAnd we'll teach ya lessons that you'll never forget\nBecause we are the MC's that (?)\nWe're on to the crack of dawn\nWe're on to the crack of dawn\nAnd young ladies, he's from the top\n\n[ Little Ikey C ]\n(He's) Little Ikey C and I'm the master rock\nYa don't stop, ya don't stop\nTold you 'bout the ding-da-da-ding-da-ding-dingy-ding\nThat thing that you call that body rock\nNow let me tell you somethin that caught my eye\nIt was a real jazzy lady, she was so fly\nShe had long hair and clothes so fine\nI said, \"I'ma keep rappin until you're mine\"\nI said, \"I'ma rap for just about a hour\"\nCause I knew the young lady was surely high power\nAnd the way she moved was like a graceful swan\nAnd we can make love to the break of dawn\nAnd the way she move is like a graceful dove\nSay could it be I'm fallin in love\n\"Will you be mine\" is what I say\nWhy don't you chill out, just gimme the play\nYa don't stop\nYa don't stop\n\nSay what's the name of this Nation?\nZulus\nZulus\nAnd who's gonna get on down?\nBambaataa\nBambaataa\n\nSay what's the name of this Nation?\nZulus\nZulus\nAnd who's gonna get on down?\nJazzy Jay\nJazzy Jay\n\nSay what's the name of this Nation?\nZulus\nZulus\nAnd who's gonna get on down?\nBambaataa\nBambaataa\n\nSay what's the name of this Nation?\nZulus\nZulus\nAnd who's gonna get on down?\nJazzy Jay\nJazzy Jay\n\n"
  },
  "3136974": {
    "title": "Girl, Cut It Out",
    "artist": "Roger Troutman",
    "id": 5347,
    "year": 1984,
    "lyrics": "\n\nGirl, cut it out\nBaby, you should know\nI've been watchin' you for days\nYou got a face like an angel\nBut I can see the devil in your ways\nEvery sinner in town is watchin' you\nSome say you got the preacher too\nThat ain't right\nGirl, cut it out\nGirl, cut it out\nOh, I used to be an innocent girl\nYes she was\nLord, but you man have busted me\nYou broke my heart\nYou took all of my money\nIt won't be like that no more\nCos' with power\nYou let me know that now\nI know what you want\nI know what makes you weak\nI'm cold blooded baby\nI got ice cubes into my veins\nYou can plead if you please\nI will not let it out\nNo, I won't cut it out\nGirl, cut it out\nGirl, cut it out\nYou know you aren't with it\nStop carryin' on that way\nYou're cold blooded\nYou nasty nasty girl\nStop with your carryin' on\nAnd change your nasty ways\nCut it out, cut it out\nCut it out, cut it out\nCut it out\nGirl, cut it out\nCut it out\nI say you know, you know, you know\nYou ain't, you ain't, you ain't\nMe doin' right, no\nGirl, cut it out\nCome on\nGirl, cut it out\n\n"
  },
  "3249546": {
    "title": "Monster Jam",
    "artist": "Spoonie Gee",
    "id": 9763,
    "year": 1980,
    "lyrics": "\n\nYou say one for the trouble, two for the time\nC'mon girls, let's rock that [whistle blows]\n\nWham, bam, the monster jam get up everybody and do the freak, to the beat\n\nWham, bam, the monster jam get up everybody and do the freak, to the beat\n\nYou're the S to the P the double O-N-Y, you're the one MC I will never deny\nYou better watch out and I tell ya why, 'cause I'm Angie B, I might give you a try\nNow you're looking in my eyes and you're in a trance\nAnd all you can think of is my sweet romance\nHey Spoonie Gee, I'm Angie B\nAnd I'd like to know what you got for me\n\nWell I'm a cherry piece, sometimes I'm a plum\nSweet as sugar baby, c'mon and get some\nWhat you've been waiting for my dear\nThat month-by-month, year-by-year\nThat day-by-day, that week-by-week\nNow you got a chance girl, I'm at my peak\nMy rap is strong, my love is long\nAnd I'ma ding of a bell before it goes dong\n\nWith my brown eyes and my cherry lips\nYou can't refuse my walnut hips\nEveryone see me, walk down the street\nThey know I'm the one with the foxy beat\nAnd I can turn ya on and I can turn ya off\n'Cause I got control 'cause I am the boss\nI'm like an Al Capone of the microphone\nIf you can't go with it then you've got to go home\n\nWham, bam, the monster jam get up everybody and do the freak, to the beat\n\nWham, bam, the monster jam get up everybody and do the freak, to the beat\n\nPound for pound, like inch for inch\nShe was [?] by [?] that I [?]\nFrom the way you look and that nice hairdo\nThat must have been what attract me to you\nWhen I asked for the loving you put me in line\nSaid, \"Huh it's too soon, you're not that kind\"\nWell I can understand Cheryl that you want to last\nBut after all ya know a long time has passed\nWhen times come around you say you're not ready\nWhen all ya gotta do is close your eyes and rock steady\nTime for love, no time for hip-hopping\n'Cause once I'm gone I ain't no stopping\nSo think it over Cheryl, tell me what you're gonna do\n'Cause I've got loving all just for you\n\nYou see Mama Dog is what they say\nI'm gonna rock Spoonie Gee in a vicious way\nWell I go by the name of the Wonder Girl\nI'm gonna rock Spoonie Gee all over the world\nI'm a beautiful lady in and out\nI was raised in a city of the beautiful South\nYa see I like a man with plenty of charm\nAnd if he got some money can't do no harm\nProfessional, now I pronounce\nI'm gonna rock this mic with my vicious sound\nYa see I'm just what the doctor ordered\nC'mon and let me check out all your boys\nI say some words you never heard\nAnd I'll hum in your ear like a hummingbird\nJust like the penicillin pill\nI'll make you well as if you're ill\nBut if you're ill can ya understand\nI'm like the pill they call Dristan\n\nWham, bam, the monster jam get up everybody and do the freak, to the beat\n\nWham, bam, the monster jam get up everybody and do the freak, to the beat\n\nGotta special rap to do it all\nRing a ding ding, telephone call\nSpoonie you can call me any time of the day\nCause I'll always have something to say\nLike Spoonie, \"What's happening?\"\n\"You Angie baby, I gave you the ring\"\nSee I got you in my arms and I'm squeezing you tight\nThe warmth of my body's like dynamite\nI'm a sonic listener, a mind twister\nI'm Angie B, your soul sister\nI'm right on time and I'm never late\nSo c'mon Blondie and participate\n\nI'll walk through hell without a sweat\nAnd I'll swim the length of any ocean without getting wet\nI'll walk through coal without a chill\nAnd I drop a can of beer without a spill\nYa see I rock a party from a-sun to sun\nWhen I rock a party it's never done\nBut I rock a party from a-week to week\nAnd I rock a party so very neat\nYa see I never mess up, I'm not lazy\nAll the fellas in the house just go crazy\nI sing them highs, I sing them lows\nI bring all the freaks to their toes\n\nLike Peaches and Herb, Herb and Peaches\nI'm Cheryl The Pearl, the grandmaster's teaching\nGonna tell you a little story about [?]\nIt's like a [?] do the hoochie-coochie\nGo knock, knock, come on in\nThe party of the night has just began\nThe freaks are here, no one is dead\nAnd can I hear somebody say \"Go 'head?\"\n\n(Go 'head!)\n\n(Go 'head!)\n\n(Go 'head!)\n\n(Go 'head!)\n\nWham, bam, the monster jam get up everybody and do the freak, to the beat\n\nWham, bam, the monster jam get up everybody and do the freak, to the beat\n\nJust listen to what I say\nWe could talk about the matter in a OJ\nOr talk about the matter over a cup of tea\nBut whatever you do conversate with me\nYou know I know a lot of dudes try to rap to you\nBut after all girl, say what can you do?\nSay, hey girl look at what ya got cookin'\nBut that's an old rap so the dude's a sap\nWell I can tell it to your face, don't have to write a letter\nTo prove it to ya baby I could satisfy ya better\nI give you some of this but at your own risk\n'Cause I'm one man that you can't resist\nThen I'm so shrewd to get you in the mood\nBefore you know it you'll be in the nude\nAnd in your house you'll be waiting for me\nThe man they call the cold-crushin' lover, MC Spoonie Gee!\n\nFreak, freak it's so unique, for us to rock Spoonie Gee out of his seat\nI said freak, freak it's so unique, for us to rock Spoonie Gee out of his seat\nI said rock, rock, rickity-ro rock, rick-rock that stereo!\nI said rock rock rock rock rickity-ro rock, rick-rock that stereo!\nFreeze!\n\nWham, bam, the monster jam get up everybody and do the freak, to the beat\n\nWham, bam, the monster jam get up everybody and do the freak, to the beat\n\nBlondie is what they say\nI'm sweeter than the candy they call the big PayDay\nLike Gloria Vanderbilt gangster jeans\nI'm the one they fit so mean\nLike the Charlie's Angels on the go\nNow I'm the angel that you should know\nLike Dolly Parton stickin' out in the front\nLike Blondie makin' the fellas grunt\nI say I get more sex than a [?]\nHey cold-crushin' lover, I'm twice as nice!\n\nIf a change of pace is what you want\nGet ready! This is a serious joint\nBecause my raps are always right on time\nGonna give you the chance to feel real fine\nNow if you're in the groove of the beat\nC'mon Spoonie Gee and rap to me\n\nSay I will not stop (I will not stop)\nI must keep on rocking (I must keep on rocking)\nSay I will not stop (I will not stop)\nI must keep on rapping (I must keep on rapping)\nHe's the cold-crushin' lover (He's the cold-crushin' lover)\nAnd you know that there is no other (There is no other)\nHe's MC Spoonie Gee! (He's MC Spoonie Gee!)\nAnd ain't a man quite like he (Ain't a man quite like he)\n\nNow say one for the trouble, two for the time\nC'mon girls, let's rock that [whistle blows]\n\nYou say one for the trouble, two for the time\nC'mon girls, let's rock that [whistle blows]\n\n"
  },
  "3257573": {
    "title": "The Big Beat",
    "artist": "Spoonie Gee",
    "id": 9763,
    "year": 1983,
    "lyrics": "\n\n[TELEPHONE RINGS]\n[Female]\nHello?\n[Spoonie Gee]\nHey baby, I'm on my way right now, okay?\n[Female]\nOkay, I'll be waiting for you\n[Spoonie Gee]\nOkay, bye\n[Female]\nBye\n\nIt's comin' girl, don't be surprised\nIt's gonna make your nature rise\nWhether you're mean or if you're sweet\nThis you won't resist, it's the big beat\n\nAnd now I've been told it's good as gold\nYou can feel it way deep down in your soul\nIt's a funky sound, it's world-renowned\nSo c'mon girl, let's get on down\nGotta do it right, whether day or night\nYa gotta rock to the beat with all your might\nThe moment has come for you to meet\nWhatever makes your body move, it's the big beat\n\nIt's the big beat\n\nNow it's plain to see that it's meant to be\nFor you and me in ecstasy\nPassion and pain, but lot to gain\nAnd the way ya are I hope you'll remain\nWith sex appeal too good to be real\nAnd it's your heart I want to steal\nSo take this chance, do this dance\nWho knows it just might lead to romance\nI hope it do, cause I want it do\nOoh girl, I wanna rock with you to the big beat\n\nIt's the big beat\n\nI know other guys have copped a plea\nBut please girl have mercy on me\nLet me take you out, let's wine and dine\nSmall cafe with food and wine\nChandelier for show, where the lights are low\nIf you don't like that well we can go disco\nBoogie down, get drenched in sweat\nFrom a good time this you can bet\nSo come on girl let's make the move\nSo that you and me can groove to the big beat\n\nFreak this\n\nAhh, it's the big beat\n\nIt's the big beat\n\nC'mon, just move your body (Shake!)\nC'mon, move your body (Twist!)\nJust move your body, just shake and twist\nBut allow me to ask you this\nDo you like it in the morning? (Yeah!)\nLate at night? (Yeah!)\nWell you know what you can do babe when I'm through\nAnd I'll make everything alright\nNow is it funky (Yeah!)\nDo you think it's bad (Yeah!)\nGirl is it good [?] for ya?\nThat's right girl, the best you ever had\nIt's the big beat\n\nIt's the big beat\n\nLet's ride around this fancy town\nIn a sports Mercedes with the top down\nShines so tough you can see your face\nLight blue outside with the dark blue lace\nSheep-skin seats as bad as can be\nTelephone in case of an emergency\nSo call me up, don't hesitate\nJust tell me what time and I won't be late\nCome cruising through, to pick up you\nAnd to ring your bell one time or two\nOr maybe three so you can creep me\nAnd start the night like it's supposed to be\nSo make up your mind, don't waste time\nAnd don't give me one of those so-so lines\nAbout I want to, but I don't know\nI got nothing to wear therefore I can't go\nCause if you really want to, you know you will\nSo c'mon girl, it's no time to kill\nJust tell me now so I can show you how\nI do, it feels good to you, it's the big beat\n\nIt's the big beat\n\nNow you know what I need and you know what I want\nSo c'mon girl, don't try to front\nDon't tell me you do when you know you don't\nDon't say that you will when you know you won't\nDon't build me up just to let me down\nDon't turn my smile into a frown\nIf I'm wasting time, please tell me now\nIf there's a way, I'd like to know how\nTo make your body move all about\nC'mon girl, let's work it out\nTo the big beat\n\nIt's the big beat\n\nNow it could be your best if you say yes\nBut if you say no well you just go\nThe night on the town, chance to get down\nTo do your thing to this brand new sound\nTo get real loose with me as your boost\nTo relax to the max and sip martinis\nLancers, Moet or Piper too\nWhatever you want, girl it depends on you\nBut first hang your coat, then ya wet your throat\nThen we're gonna do what ain't no joke\nBecause Whether you're mean or if you're sweet\n(Uh) This you won't resist, it's the big beat\n\nThis you can't resist, it's the big beat\n\nThis you better not miss, it's the big beat\n\nJust talk about, it's the big beat\n\nOoh girl, gonna make you scream and shout, it's the big beat\n\nIt's the big beat\n\nIt's the big beat\n\nIt's the big beat\n\nIt's the big beat\n\nIt's the big beat\n\n"
  },
  "2847507": {
    "title": "Starski Live At The Disco Fever",
    "artist": "Lovebug Starski",
    "id": 995669,
    "year": 1983,
    "lyrics": "\n\n[Lovebug Starski]\nWell, hello everybody! How ya been?\nIt's Starski and I'm back again\nWit' a true, true story to tell you all\nAnd if you listen to me, you're gonna have a ball\nFirst you dive with the dip, dip with the dive\nClean out your ears, and you open your eyes\n'Cause I'm the L-O-V-E B-U-G\nRockin' it in rhythm and harmony\nSee I'm snug as a bug, like to be hugged\nAnd that's why the ladies call me the Lovebug\nOn, on, on-on and on\nAt the Fever, a-to the break o' dawn\nYes yes ya'll, a-keep goin' strong\n(At the Fever!) A-right where I belong\nPut your hand on your hip or let your backbone slip\nThe metal on the pedal, the heat in the beat\n'Cause the people in the back, they not the wack wack\nThe people in the front, let's do the bump bump\nThe people on the side, hey, take a ride\nThe people in the middle, let me see you wiggle\nAll together now, on time ya'll\nYou just look in the sky, look in the tree\nWho do you see? (Starski!)\nWho do you see? (Starski!)\nA little Baw-ba-ba-baw, ba-baw, ba-baw-ba-baw-ba\nBaw-ba-ba-baw, ba-baw, ba-baw-ba-baw-ba\nBaw-ba-ba-baw, ba-baw-ba-dang-a-dang-a\nDiggy diggy diggy diggy dang, hey\nHip, hop, shoo bop da bop\nIt's the Lovebug, and I'm guaranteed to rock\nSee you paid your money as a donation\nTo hear the best sounds in the Fever!\nA creation, a-yes-yes, ya'll\nA-young lady, don't you act crazy\nHomeboys, you know you got to make some noise\nSay: Hey money money, hey money money money!\n(Hey money money, hey money money money!)\nA-come on now: Hey money money, hey money money money!\n(Hey money money, hey money money money!)\nSomebody scream! (Wooooooo!)\nA little hip, hop, da hib bip a-hop, da hop, da hop\nHibby dibby hibby dibby hibby\nThen you rock the hip, and then you rock the hop\nAnd you make sure you make your body rock\nA little hip, hop, da hibbity da hibbity, hip hip a hop\nA-hit-a-little-hit-a-little\nHip, hop, da-hib bip a-hop\nYou don't, you don't, you don't, you don't mess with the\nBaw-ba-ba-baw-ba-dang-a-dang-diggy-diggy\nBaw-ba-ba-baw-ba-dang-a-you need a\nBaw-ba-ba-baw, shoo bop da bop\nCause I'm guaranteed to make your body rock\nAt the Fever, they give me no breather!\nAt the Fever, we make you a believer!\n\n"
  },
  "3235732": {
    "title": "Starski Live At The Fever Pt. II",
    "artist": "Lovebug Starski",
    "id": 995669,
    "year": 1984,
    "lyrics": "\n\nHere we go again\n\nWell, hello everybody\nHow you been?\nIt's time to rock the Fever once again\nThe last time you heard me I made you a believer\nAt a place called Disco Fever\n\nNow it's 10 o'clock, it's time to rock\nThe music's on and the doors unlocked\nThe ladies, the men, they stand in line\nJust to hear Love Bug rock those rhymes\nNow go \"Bah ba ba ba bah bah bah bah\"\n(Bah ba ba ba bah bah bah bah!)\nEverybody go bah ba ba ba bah bah bah bah\n(Bah ba ba ba bah bah bah bah!)\nHey just throw your hands in the air, everybody\nThrow your hands in the air a little higher\nSay hooooo (Hooo!) Now scream (Oooooo!)\nNow ladies listen up, don'tcha dare fight\nYou gotta be real to get what you want\nJust get on the floor, stick to the script\nWatch it baby doll and don'tcha dare slip\nCause I'm the captain of the ship, conductor of the train\nGonna let you know that I'm running things\nLike ashes to ashes, dust to dust\nIf the Lord doesn't get you my music must\nAhhhhh!\n\nNow ladies, all the ladies\nDon'tcha dare act too shady\nJust throw your hands in the air\nAll the ladies, throw your hands in the air\nI wanna hear you say Oooooo! (Ooooo!)\nOoooooo! (Oooooo!)\nScream (Oooooooooooo!)\nLove Bug! Starski!\n\nHomeboys, this one's for you\nIf you're by yourself or with your crew\nYou gotta be strong to survive\nSo [?] my man, we're kickin' it live\nOne on one, we're gonna have some fun\nTwo on two, you know what to do\nTell me baby doll soul socialize\nClean out your ears and ya open your eyes\nKickin' it live at the place to be\nIt's the Fever my man and I'm Starski\nNow homeboys, if you're feeling good say \"Yeah, yeah, yeah, yeah, yeah!\"\n(Yeah, yeah, yeah, yeah, yeah!)\nLet me hear you say \"Yeah, yeah, yeah, yeah, yeah!\"\n(Yeah, yeah, yeah, yeah, yeah!)\nEverybody go \"Yeah, yeah, yeah, yeah, yeah!\"\n(Yeah, yeah, yeah, yeah, yeah!)\nLet me hear you go \"Yeah, yeah, yeah, yeah, yeah!\n(Yeah, yeah, yeah, yeah, yeah!)\nNow freeze!\n\nWe're having fun!\n\n"
  },
  "3258036": {
    "title": "You've Gotta Believe",
    "artist": "Lovebug Starski",
    "id": 995669,
    "year": 1983,
    "lyrics": "\n\nYou've gotta believe!\n\nYou've gotta believe!\n\nWell, I've been through times not so hot\n\nI did the best with what I've got\nI didn't let those things bother me\nBelieved in my own V.I.P\nWhen things got bad, very slim\nI didn't think that I could win\nAbout to drown my troubles in the sea\nBut these words of wisdom came to me\n\nYou've gotta believe! (Don't let no one say you can't make it)\n\nYou've gotta believe! (When things go wrong just overtake it)\n\nYou've gotta believe! (Just tell yourself I've got to make it)\n\nYou've gotta believe! (So c'mon everybody, let's shake it!)\n\nSuffering and misery from day to day\nI kept my faith and I knew there was a way\nTo let those things be understood\nThings that look bad can change to good\nAnd if you want things bad enough\nTo be a winner you must stand tough\nCause quitters kick the bottom shelf\nSo just remember, believe in yourself!\n\nYou've gotta believe! (Don't let no one say you can't make it)\n\nYou've gotta believe! (When things go wrong just overtake it)\n\nYou've gotta believe! (Just tell yourself I've got to make it)\n\nYou've gotta believe! (So c'mon everybody, let's shake it!)\n\n[Break]\n\nYou've gotta believe!\n\n[Break]\n\nCause I'm looking forward to a better day\nThe Lord works in mysterious ways\nI don't know what tomorrow will bring\nI just hope that it'll change some things\nThe man upstairs, he has his plan\nHe won't give you more than you can stand\nSo when it looks like there's no other way\nJust remember these words I say\n\nYou've gotta believe! (Don't let no one say you can't make it)\n\nYou've gotta believe! (When things go wrong just overtake it)\n\nYou've gotta believe! (Just tell yourself I've got to make it)\n\nYou've gotta believe! (So c'mon everybody, let's shake it!)\n\n"
  },
  "41669": {
    "title": "P.S.K. What Does It Mean?",
    "artist": "Schoolly D",
    "id": 10279,
    "year": 1984,
    "lyrics": "\n\n(The offical adventures of...)\n\n[Hook]\nPSK we're making that green\nPeople always say, \"What the hell does that mean?\"\nP for the people who can't understand\nHow one homeboy became a man\nS for the way we scream and shout\nOne by one I'm knocking you out\nK for the way my DJ cutting\nOther MC's, man you ain't saying nothing\nRocking on to the break of dawn\nI think Code Money, your time is on\n\n[Hook]\n\n[Verse 1]\nDriving in my car down the avenue\nTowing on a j, sipping on some brew\nTurned around, see the fly young lady\nPull to the curb and park my Mercedes\nSaid \"Fly lady, now you're looking real nice\nSweeter than honey, sugar and spice\"\nTold her my name was MC Schoolly D\nAll about making that cash money\nShe said, \"Schoolly D, I know your game\nHeard about you in the hall of fame\"\nI said, \"Mama, mama, I tell you no lies\nCause all I wanna do is to get you high\nAnd uh - lay you down and do the body rock\"\nTook a walk to the corner, got into the car\nTook a little trip to a fancy bar\nCopped some brew, some j, some coke\nTell you now, brother, this ain't no joke\nShe got me to the crib, she laid me on the bed\nI fucked her from my toes to the top of my head\nI finally realized the girl was a whore\nGave her ten dollars, she asked me for some more\n\n[Hook]\n\n[Verse 2]\nClinton Road one Saturday night\nTowing on a cheeba I was feeling alright\nThen my homie-homie called me on the phone\nHis name is Chief Keith, but we call him Bone\nTold me 'bout this party on the Southside\nCopped my pistol, jumped into the ride\nGot at the bar, copped some flack\nCopped some cheeba-cheeba, it wasn't wack\nGot to the place, and who did I see\nA sucker-ass nigga trying to sound like me\nPut my pistol up against his head\nAnd said, \"You sucker-ass nigga I should shoot you dead\"\nA thought ran across my educated mind\nSaid, man, Schoolly D ain't doing no time\nGrabbed the microphone and I started to talk\nSucker-ass nigga, man, he started to walk\n\n[Hook]\n\n"
  },
  "2399615": {
    "title": "Battle w/Busy Bee (Harlem World, 1981)",
    "artist": "Kool Moe Dee",
    "id": 1710,
    "year": 1981,
    "lyrics": "\n\n[Verse 1:  Kool Moe Dee]\nOne for the treble, two for the bass\nC’mon Easy Lee and let’s rock the place!\nOne, two, one, two\nDo what you do, now!\n\nHold on, Busy Bee, I don’t mean to be bold\nBut put that “ba-ditty-ba” bullshit on hold\nWe gonna get right down to the nitty-grit\nGonna tell you little somethin’ why you ain’t shit\nIt ain’t a emcee's jock that you don’t hug\nYou even bit your name from the “Lovebug”\nAnd now to bite a nigga’s name, that’s some low-down shit\nIf you was money, man, you’d be counterfeit\nI gotta give it you, though, you can rock\nBut everybody know you’re on the Furious' jock\nAnd I remember, Busy, from the olden-times\nWhen my man, Spoonie G, used to sell you rhymes\nRemember that rhyme called, “Ditty-Ba-Ditty”?\nMan, goddamn, that shit was a pity!\nToo hot to trot, here to rock a spot\nSpoonie G rocked it whether you like it or not\nHe begged for the rhyme, asks for it twice\nHe says, “Spoonie G, I’ll buy at any price!”\nWhen Spoonie finally sold it, oh, what a relief\nBusy B stole it like a fuckin’ thief\nCame out rockin’, the party hard\nGot everybody thinkin’ that shit-sound's yours!\nEvery time I hear it, I throw a fit\nParty after party – the same old shit!\nRecord after record, rhyme after rhyme\nAlways want to know your zodiac sign\nHe changed the shit to the favorite jeans\nC’mon, Busy Bee, tell me what that means\nHold on, brother man, don’t you say nothing\nI’m not finished yet, I gotta tell you something\nToo hot to trot, I’m here to rock the spot\nI’m gonna rock your ass whether you like it or not\nI’ll take the title right here on the spot\nHow can I take a title you ain’t got?\nYou’re not number one, you’re not even the best\nAnd you can’t win no real emcee contest\nCelebrity clubs and bullshit like those\nThose the kind of shows everybody knows\nCelebrity clubs, those are the kind you can win\nThey’re all set up before he comes in\nBut in a battle like this, you’d know you’d lose\nBetween me and you, who do you think they’ll choose?\nWell, if you think it’s you, I got bad news\n‘cause when you hear your name, you’re gonna hear some boos\n‘cause you’re fakin’ the funk, ‘cause you’re fakin’ the funk\nAnd at the end of this rock, you can call me unc-le\nMo Dee rock shock the house\nCall me unc-le\nRock the house, y’all\n\nLike this y’all, a-like this y’all\nLike this-a-this, it’s like this y’all\n\n[Verse 2:  Kool MoeDee]\nNow you popcorn-peanut-toy emcees\nNever ever ever heard no rhymes likes these\n‘cause my intent, from the time I sent\nIs to say those rhymes that I invent\nAnd for your pleasure, a rhyme you’ll treasure\nPlease don’t try ‘cause you can’t measure\nThe length of time can’t touch the rhyme\nHip hop don’t stop, ‘cause you know I’m\nAn MC supreme and I’m one-of-a-kind\nAnd if you search real hard, I’m sure you’ll find\nAin’t another MC who can rhyme like this\nNot your mother or your father, aunt, brother, or your sis\nSit back and enjoy, don’t try to fight\n‘cause it’s very hard to say any rhyme I write\nBut do it like this, do it like that\nConcentrate real hard and get the rhyme down pat\nAnd no matter how hard you try, you’ll see\nYou’ll get your mind into mine and can’t say it like me\nBut you wanna be – Busy wanna-be!\nCause you know he wanna be another Kool Moe Dee\nSo let’s all chant, because you know you can’t\nEverybody salute to the new MC champ\n\nIt’s like this y’all, like this y’all\nLike this-a-this, it’s like this y’all\n\n[Verse 3: Kool Moe Dee]\nNow that “ba-ditty-ba-da-dang-da-dang-dang”\nSound pretty good, but it ain’t no thang\nI’m the super scooper, party pooper\nMan with all the super-duper\nDisco breaks, have what it takes\nA man who never makes mistakes\nCan rap it low, I’m not a bore\nBaddest man you ever saw\nMoney-makin’, earthquakin’\nMan-who-gets-the-party-shakin’\n\n[LA Sunshine]\nNo complication, stimulation\nMan-who’s-gonna-rock-the-nation\nRhyme, rhyme, battle time\nMy opponent: he’s all mine\nI’m not the baddest, not the maddest\nWhen I win I am the gladdest\nNo beginner, not a sinner\nOn the mic I'm just a winner\n\n[Kool Moe Dee]\nVery, very, very, very\nEvery time I bust a cherry\nOh my god, it's fame and glory\nThought I’d never tell this story\nOnly time I'm from the mic\nBecause it’s something that I like\nTo reassure, the rhymes are low\nI always keep some sex in store\n\n[LA Sunshine]\nThe baddest bad, superbad\nNever sad, always glad\nRhymer that you'd rather have\nIf you [?] you never had\nSleek, sleek so unique\nGuaranteed to move your feet\nSo ladies, I'm without  a doubt\nGuaranteed to turn it out\n\n[Kool Moe Dee]\nRemember me, MC Moe Dee\nThe man that’s at the T-O-P\nAnd ladies’ dream the way it seems\nWhen they see me, their eyes are gleamin’\nI’m so shocking when I’m rocking\nBound to get your fingers popping\nHave no doubt, I turn it out\n‘Cause that’s a party’s all about\n\n[LA Sunshine]\n[?] right on through it\nI don't need no disco fluid\n\n[Kool Moe Dee]\nBall-playing, girl-laying\nOn the mic, a rhyme-saying\nMC who rock viciously\nSatisfaction guaranteed\nOr you get your money back\nBelieve me, girl, it's not the whack\nTreach-er-ous Three, as you can see\nSpecial K, Sunshine, and I'm Kool Moe Dee\n\nSigning off y'all, signing off y'all\nFrom the South to the West to the East to the North\nBusy Bee, my man, you know I went off!\nA-Chill out, chill-a-chill out, chill on out\nChill out, chill-a-chill out, chill on out\n\nBusy Bee!\n\nBusy Bee, Busy Bee\nBusy Bee Starski, I'm Kool Moe Dee\nThe best MC and that's my trophy!\nChill out, chill-a-chill out, chill on out\nChill out, chill-a-chill out, chill on out\n\n[LA Sunshine]\nAnd I just want all of y'all to know\nThat's why I'm on his dick!\nThat's why I'm on Moe Dee's dick!\n\n"
  },
  "27136": {
    "title": "8 Million Stories",
    "artist": "Kurtis Blow",
    "id": 803,
    "year": 1984,
    "lyrics": "\n\n[Intro]\nThere are 8 million stories in the naked city\n\n8 million stories\n8 million stories (Cold-hearted city)\n8 million stories (Watch your back)\n8 million stories\n\n[Verse 1: Kurtis Blow]\nThere are 8 million stories in the naked city\nSome ice cold and told without pity\nAbout the mean streets and the ghetto culture\nThe pimps, the pushers, the sharks and vultures\nThings that happen when it reaches dark\nAnd all the things you hear about Central Park\nYou got to be down, you got to have strength\nIf you're gonna survive past 110th\nWell it ain't no thing when blood is spilled\nThe emergency ward is capacity filled\nAnd nothing ever comes as a big surprise\nAnd the naked city never closes its eyes\nA new story every day\nTold a thousand different ways\nThat's how it is and that's how it goes\nThe city with the 8 and six big O's\n\nNew York is a crazy city man\nWord, skyscrapers, everything\nAnd you just never know who you might be meting in this town\nYo, my home boys Run DMC\n\n[Verse 2: Run DMC]\nA young girl seemed to be gaining weight\nHer parents all thought it was the food she ate\nTheir attitudes were all \"La Di Da Di\"\nBut little did they know there's a baby in the body\nShe tried to hide it, but they'll soon know\nBecause sooner or later that baby's got to show\nCan her daddy just accept it as a fact\nThat it wasn't the meals and it wasn't the snack\nThen there's another girl, her name is Vicki\nThe girl is fine, but sho'nuff tricky\nVicki's fine, but then she's not very kind\nShe'll lay you down and then she'll rob you blind\nYou wake up in the morning and you're feeling blue\nBecause Vicki is gone and your money is too\nShe's more sinister than Peter Lorre\nAnd this is just two of 8 million stories\n\n8 million stories\n8 million stories\n8 million stories (You hear what i'm saying)\n8 million stories (Homeboys and girlies)\n8 million stories\n8 million stories\n\n8 million stories\n8 million stories\n8 million stories (Sing)\n8 million stories (Sing the song)\n8 million stories\n8 million stories\n\n[Verse 3: Kurtis Blow]\nFresh kid and the stories complete\nBorn on a dim lit ghetto street\nFather unknown, mother astray\nHe learned about life the real hard way\nWearing pretty things for all the ladies to see\nFunky fresh diamonds and gold jewelry\nSpent all his time just counting his bank\nBecause he's a fly muh-ha-ha, now fill in the blank\nBecause he's a fresh kid and his money's long\nBeen the subject of a ghetto song\nPoor kids admire, ladies desire\nThey say water can't put out this fire\nBecause he's a fresh kid, yeah he's alright\nGrew up with the pushers and the pimps of the night\nAnd you could measure or even treasure\nThe thought that cocaine became his pleasure\nPeruvian rock never cut with speed\nAnd he gets skied until his nose would bleed\nAnd that was just one weakness, must admit\nThat when he took a hit he could never quit\nBecause he's one slick pusher living day by day\nWhen the crazy thing happened along the way\nYou know he started to base at a hell a pace\nAnd now it's a disgrace, he's got the pipe in his face\nFor twenty-four seven a terrible Jones\nDidn't take care of business, didn't answer the phone\nHe stayed home alone all in the twilight zone\nJust biting on a pipe like a dog on a bone\nTurning blue in the face, by just holding his breath\nWith the white cloud bullshit stuck in his chest\nBut then he tried to stop, but it never worked\nAnd then the ladies started calling him a freebase jerk\nJust to break it all down, you know he's not so slick\nBecause he spent all his money and he spent it real quick\nHe lost his car, his house, his friends, his wife\nAnd basing cocaine made him lose his life\nBecause he bought some on credit and couldn't pay\nAnd then the pusher looked for him and blew him away\nIn a blaze of glory in his own territory\n8 million sad but all real stories\n\n8 million stories\n8 million stories\n8 million stories (You hear what i'm saying)\n8 million stories (Homeboys and girlies)\n8 million stories\n8 million stories (Sing)\n8 million stories (Sing the song)\n8 million stories\n8 million stories\n8 million stories\n8 million stories\n8 million stories\n\n"
  },
  "27139": {
    "title": "AJ Scratch",
    "artist": "Kurtis Blow",
    "id": 803,
    "year": 1984,
    "lyrics": "\n\n[Intro]\nOne, two, three, four, hit it\nOne- one- one- one\nTwo- two- two- two\nThree- three- three- three\nFour- four- four- four\nHit- hit- hit- hit\nOne, two, three, four, hit it\n\n[Verse 1: Kurtis Blow]\nUp in the Bronx, where the people are fresh\nThere was one DJ who had to pass the test\nAnd now he's down by law and he's ready to play\nThat's right, y'all, his name is AJ\nNever gets nervous when he cuts the beat\nHe gets top notch service in the clutch on the street\nA complete elite treat that can't be beat\n'Cause AJ never knew the agony of defeat\nSing\n\n[Chorus]\nAJ, I wanna see you\nAJ, I wanna see you\nAJ, I wanna see you\nAJ\nOoh- ooh- ooh- ooh\nKurtis Blow\nOoh- ooh- ooh- ooh- ooh\nKurtis Blow\nOoh- ooh- ooh\nOoh- ooh- ooh\n\n[Verse 2: Kurtis Blow]\nGrandmaster Flash, Afrika Bambaataa\nStarsky, Spoonie Gee and Run DMC gotta\nGotta realize that he goes way back\nAnd now he's down with the king\nAnd we could never be wack\nSo just kick off you shoes and relax your feet\nAnd just rock to the rhythm of the Kurtis Blow beat\nYes, yes, y'all and just shake your butt\nBecause AJ is gonna cut it up\nSing\n\n[Chorus]\nAJ, I wanna see you\nAJ, I wanna see you\nAJ, I wanna see you\nAJ, I wanna see you\nHit- hit- hit me\nHit- hit- hit me\nHit- hit- hit me\nHit- hit- hit- hit- hit- me\n\nGet- get- get\nGet- get- get- get\nGet- get- get- get\nGet- get- get- get down\nGet down\n\nYes, yes, y'all\nYes, yes, y'all\nYes, yes, yes, yes, yes, yes, y'all\nYes, yes, y'all\nYes, yes, y'all\nYes, yes, yes, yes, yes, yes, y'all\nYes, yes, y'all\nYes, yes, y'all\nAJ has got to be the best, y'all\nYes, yes, y'all\nYes, yes, y'all\n'Cause Kurtis Blow is fresh- fresh, y'all\n\nYeah- yeah- yeah- yeah- yeah\nYeah- yeah\nYeah- yeah- yeah\nYeah- yeah- yeah- yeah- yeah\nYeah- yeah\nYeah- yeah- yeah\nYeah- yeah- yeah- yeah- yeah\nYeah- yeah\nYeah- yeah- yeah\nYeah- yeah- yeah- yeah- yeah\n\n[Verse 3: Kurtis Blow]\nUp in the Bronx, where the people are fresh\nThere was one DJ who had to pass the test\nAnd now he's down by law and he's ready to play\nThat's right, y'all, his name is AJ\nNever gets nervous when he cuts the beat\nHe gets top notch service in the clutch on the street\nA complete elite treat that can't be beat\n'Cause AJ never knew the agony of defeat\nSing\n\n[Chorus]\nAJ, I wa- I wa- I wanna see you\nAJ, I wanna- I wan- I wan- I wanna see you\nAJ, I wanna- I wan- I wanna see you\nAJ, I wanna- I wan- I wanna see you\nClap- clap- clap- clap- clap\nClap- clap- clap- clap- clap\nClap- clap- clap- clap- clap- clap\nClap- clap- clap- clap- clap- clap- clap- clap\nClap your hands\nClap your hands\n\n"
  },
  "5322": {
    "title": "Basketball",
    "artist": "Kurtis Blow",
    "id": 803,
    "year": 1984,
    "lyrics": "\n\n[Chorus]\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\n\n[Verse 1]\n(Now rapping basketball -- Number 1, Kurtis Blow)\nBasketball is my favorite sport\nI like the way they dribble up and down the court\nJust like I'm the king on the microphone\nSo is Dr. J and Moses Malone\nI like slam dunks, take me to the hoop\nMy favorite play is the alley-oop\nI like the pick-and-roll, I like the give-and-go\nCause it's basketball, uh, Mister Kurtis Blow\n\n[Chorus]\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\n\n[Verse 2]\nI used to go to dinner, then take the girl\nTo see Tiny play against Earl The Pearl\nAnd Wilt, Big O, and Jerry West\nPlay basketball at it's very best\nBasketball has always been my thing\nI like Magic, Bird, and Bernard King\nAnd number 33, my man Kareem\nIs the center on my starting team\n\n(To the hoop, y'all, watch out, watch out\nIn yo' face, now here comes the rest)\n\n[Verse 3]\nClyde, Rick Barry, and Pistol Pete\nNow these players could never be beat\nIsiah, and Iceman too\nJust give 'em the ball, and then you chalk up two\nDantley and Wilkins are on the scene\nAnd Ralph Sampson is really mean\nBill Russell didn't take no junk\nAnd Darryl Dawkins got a monster dunk\n\n[Verse 4]\nTell me, were you in the joint\nThe night Wilt scored 100 points?\nOr when Celtics won titles back-to-back\nAnd didn't give nobody no kind of slack?\nOr when Dr. J shook the whole damn team\nWith moves that came right out of a dream?\nOr when Willis Reed stood so tall\nPlaying D with desire? It's basketball!\n\n[Chorus]\nThey're playing basketball\nWe love that basketball\nThey're playing basketball\nWe love that basketball\n\n[Verse 5]\nI get the ball and then I go and play\nLike a superstar in the NBA\nThe forwards, the centers, and all the guards\nThe ones you see on the bubblegum cards\nMe and homeboy would go one-on-one\nCause playing the game is a lot of fun\nSit by the TV and watch 'em all\nCause Kurtis Blow is rapping basketball\n\n"
  },
  "27140": {
    "title": "Daydreamin'",
    "artist": "Kurtis Blow",
    "id": 803,
    "year": 1982,
    "lyrics": "\n\nLooking back through time in the corners of my mind\nI see you standing here\nOh baby how I miss you\nAnd how much I need to kiss you\nRun my fingers through your hair\nBut then again,it's just my imagination\nBeing close to you was such a sweet sensation\nBut then we had to have that terrible confrontation\nNow all I can do to help this situation\n\nDaydreamin' takes me where I want to be\nDaydreamin' lets me have you here with me\n\nOh,girl if you knew all that I've been going through\nYou'd have a change of heart\nBut come rain or shine you're foverer on my mind\nOf my life you're the part\nBut then again,it's just my imagination\nBeing close to you was such a sweet sensation\nBut then we had to have that terrible confrontation\nNow all I can do to help this situation\n\nDaydreamin' takes me where I want to be\nDaydreamin' lets me have you here with me\n\nDaydreamin' and I'm thinkin' of you\nYou stole my heart and I belong to you\nDaydreamin' and I'm thinkin' of you\nYou are the one and I will be true\n\nD...D...D...D...Daydreamin' (x4)\n\nYou know I want you girl\nYou know I miss you girl\nCome back,come back baby..oo-wee,be my lady\nYou know I miss you girl\nYou were my only world\nCome back,come back honey\nMake my day bright and sunny...yeah\n\nCome back ...honey....\n\n"
  },
  "3448072": {
    "title": "Do The Do",
    "artist": "Kurtis Blow",
    "id": 803,
    "year": 1981,
    "lyrics": "\n\n[Verse 1]\nSounds that you hear, so good to your ear\nHave no fear Kurtis Blow is here\nLadies in the place with the bass in your face\nCheck out first place in the MC race\nA motivatin', syncopatin', dominatin', hesitatin'\nRappin' son of a gun\nAnd i'm lookin' for participation from the people of the nation\nMaking up a cut creation\nJam on the one\n\n[Bridge]\nDo the do (Do the do!)\nDo-do the do (Do-do the do!)\nDo the do (Do the do!)\nDo-do the do (Do-do the do!)\nYour mama (Your daddy!)\nYour sister (Your brother!)\nYour cat (Your dog!)\nI'm just jokin'!\n\n[Outro]\nDo the do (Do the do!)\nDo-do the do (Do-do the do!)\nDo the do (Do the do!)\nDo-do the do (Do-do the do!)\nSay uh! (Uh!)\nSay uh-uh! (Uh-uh!)\nSay uh-uh-uh! (Uh-uh-uh!)\nNow Scream!\n\n"
  },
  "80089": {
    "title": "Hard Times",
    "artist": "Kurtis Blow",
    "id": 803,
    "year": 1980,
    "lyrics": "\n\n[Verse 1]\nHard times spreading just like the flu\nYou know I caught it just like you\nThe prices going up, the dollars down\nYou got me fallin' to the ground\nTurn around, get ready, check out the time\nGet ready all people for the future shock\nHard times (Hard times)\nHard times (Hard times)\nTo the bridge\n\n[Bridge]\n\n[Verse 2]\nHard times people of the planet\nTimes are tough, tough is granted\nHard times coming to your town\nGet ready cause you know, we're gonna throw down\nI'm gonna go out there and get the skills\nMy life's been down and I need a thrill\nHard times (Hard times)\nHard times (Hard times)\nTo the bridge\n\n[Bridge]\n\n[Verse 3]\nHard times's got my pockets all in change\nI tell ya what, it don't have my brains\nWill I ever-ever-ever reach my peak\nWe need that dollar every day of the week\nHard times you know, it's a natural trip\nI'm gonna keep about it, so we'll not slip\nHard times (Hard times)\nHard times (Hard times)\nTo the bridge\n\n[Bridge]\n\n[Verse 4]\nHard times is nothing new or mean\nI'm gonna use my strong mentality\nLike the cream of the crop and the crop of the cream\nBeating hard times, that is my dream\nHard times in life, hard times in death\nI'm gonna keep on fighting 'till my very last breath\nHard times (Hard times)\nHard times (Hard times)\nTo the bridge\n\n[Bridge]\n\n[Repeat Verse 4]\n\n[Bridge]\n\n"
  },
  "3240462": {
    "title": "One-Two-Five (Main Street, Harlem, USA)",
    "artist": "Kurtis Blow",
    "id": 803,
    "year": 1983,
    "lyrics": "\n\nCome with me and let´s take a trip\nWhere the scene is tough and the folks are hip\nI can´t tell a lie cause it ain´t no myth\nI´m talking about a Hundred Twenty Fifth\n\nFoxy ladies everywhere\nSkin tight jeans and jazzy hair\nClothes for the body, shoes for the feet\nAnd lots of tasty things to eat\n\nA Hundred and Twenty Fifth Street\nThe people and the concrete\nThe hottest spot to work and play\nMain Street, Harlem, USA!\n\nOriginal paintings on the walls\nMusic stores and bingo halls\nApollo´s gone, but that´s OK\nThere´s lots of music anyway\n\nThe Baby Grand is still going strong\nCelebrity Club rocks all night long\nSikulu Records is on the case\nAnd Bobby´s chillin´out in the same old place\n\nLots of folks have passed this way\nMalcolm X and Billie Holiday\nFidel Castro, The Commodores\nHeads of State and troubadours\nThe Count, The Duke, The Pres, The Bird\nHave bought music and that´s my word\nDionne Warwick, Stevie Wonder\nHave all come for Harlem´s thunder\n\nMarcus Garvey and JFK\nMeadowlark Lemon and Doctor J\nAnd Doctor Martin Luther King\nAll came to Harlem to do their thing\n\nLouis, Jack Johnson and Ali\nThe heavyweight to name but three\nBill Bojangles and James Brown\nSpent their time in Harlem Town\n\nCon-men, poets, saints and sinners\nThree time losers and all time winners\nPoliticians, fools and sages\nEnough to fill a million pages\n\nSo take the trip and come alive\nThe A train stops at One-Twenty-Five\nWhere I was born one August day\nOn Main Street, Harlem, USA\n\n"
  },
  "385571": {
    "title": "Rappin' Blow, Pt. 2",
    "artist": "Kurtis Blow",
    "id": 803,
    "year": 1980,
    "lyrics": "\n\nWhat did you say your name was?\n\nI see that its not clear\nFor you good buddy so clean out your ears\nSo listen very closely while I pop my game\nCause my name's in the Hall of Fame\n\nThe K-U-R, the T-I-S\nThe first is the best I must confess\nThe B-L-O and the W\nMakes you wanna catch the boogaloo flu\n\nNow, If your name is Annie\nGet up off your fannie\nIf your name is Clyde\nGet off your backside\nIf you name is Pete\nYou don't need a seat\n\nCause i'm Kurtis Blow and i'm on the go\nI'm rocking to the beat in stere-ere-o\n\nNow just throw your hands in the air\nAnd wave 'em like you just don't care\nAnd if your ready like Freddie to rock real steady\nSomebody say, \"Oh yeah!\"\n\nYoung ladies, all the ladies in the house say, \"Owww\"\nAnd you don't stop, come on, come on, come on, let me see you rock\n\nAh get down and stop messing around\nWhen Kurtis Blow is in your town\nI'm Kurtis Blow on the microphone\nA place called Harlem was my home\n\nI was rocking one day, it started to shake\nIt sound to me a-like a earthquake\nI packed my bags, I said goodbye\nI kissed my woman, and I started to fly\n\nI came to Earth by a meteorite\nTo rock you all on the mic\nSo just kick off your shoes, let your fingers pop\nKurtis Blow's just about ready to rock\n\nNow people in the back, if you're not the wack, say:\n\"Don't stop the body rock!\"\n\nPeople in the front, if you want to bump, say:\n\"Don't stop the body rock!\"\n\nPeople in the middle, if you want to wiggle, say:\n\"Don't stop the body rock!\"\n\nAnd people on the side, if you want to slide, say:\n\"Don't stop the body rock!\"\n\nNow a preacher or a teacher or a e-lec-tri-cian\nA fighter, or a writer, or a po-li-ti-cian\nThe man with the key to your ignition\nKurtis Blow is competition\n\nYoung ladies, shock the house\nYes, the young ladies, shock the house\n\nA-just throw your hands in the air\nAnd wave them like you just don't care\n\nIf you're really, really ready to rock the house this morning\nSomebody say, \"Oh yeah!\" (Oh, yeah!)\n\nSomebody scream\n\nYoung ladies, Mercedes, all the ladies in the house say \"ow\"\n\"Ow\"\n\nSay Ho, ho, ho, ho, ho-ho-ho!\n\n"
  },
  "27134": {
    "title": "Starlife",
    "artist": "Kurtis Blow",
    "id": 803,
    "year": 1981,
    "lyrics": "\n\nIf you party hearty\nIf you make the scene\nIf you've got the jones\nFor a limousine\nForget your worries\nAnd the way things are\nSpend a day in the life\nOf a superstar!\n\nStar life\nStaarraarraarr life\nStar life\nStaarraarraarr life\n\nOn Monday morning, he checks the news\nHe's number one in rhythm and blues\nFrom record to record he tops the sheet\nAnd the other stars cannot compete\nHe hits the notes that are so high\nThe men just stare and the women cry\nThey come to see him from near and far\nThe man they made a superstar\n\nThe genuine owner of twenty cars\nSpends all his days among the stars\nAnd when he's got to cool out and chill\nGot a brand new house at the top of the hill\nOne of a kind, not even two\nPush button down with an open view\nAnd every room's got a new TV\nAnd every dog's got a pedigree\n\nLivin' every day in the life of a star\nStar life!\nLivin' every day in the life of a star\nStar life!\nHuh!\n\nHe's got a mansion up in Beverly Hills\nWith a great big swimming pool\nGot a townhouse back in old New York\nWhere he used to go to school\nAnd some folks say\nHe's got his own chalet\nIf he wants to go and ski\nAnd a house in France\nFor a little romance\nOutside of gay Pari!\nHa ha, ha ha!\n\nStar life\nStaarraarraarr life\nStar life\nStaarraarraarr life\n\nStar life\nStaarraarraarr life\nStar life\nStaarraarraarr life\n\nWherever he goes, he sets the mood\nWith the fly, fly clothes and the fancy food\nAll over the town with the pretty girl\nHe makes the scene and he rocks the world\nHe's makin' money, maybe even the most\nWith the bass that's known from coast to coast\nHe gets the best; he gets it all\nHe's got fifty gold records up on the wall!\n\n"
  }
}